import Footer from '../Footer/Footer';
import { useState } from 'react';
import { useTranslation } from 'react-i18next';

function classNames(...classes) {
    return classes.filter(Boolean).join(' ');
}

export default function Agreement() {
  const [activeTab, setActiveTab] = useState(0);
  const { t } = useTranslation();
    const tabs = [
        {
            name: 'Пользовательское соглашение и персональные данные',
            content: (
                <div className="flex flex-col gap-3 mb-9 ">
                    <p className="text-justify indent-8">
                        Пожалуйста, внимательно ознакомьтесь с приведенными ниже правилами пользования сайтом&nbsp;
                        <a href="https://mymedkz.info/">https://mymedkz.info/</a>&nbsp; (&laquo;Правила&raquo;).
                    </p>
                    <p className="text-justify indent-8">
                        На этой странице описаны условия, регулирующие использование информационного портала&nbsp;
                        <a href="https://mymedkz.info/">https://mymedkz.info/</a>&nbsp; (&laquo;Сайт&raquo;) пользователем Сайта
                        (&laquo;Пользователь&raquo;).
                    </p>
                    <p className="text-justify indent-8">
                        Пользователь обязан полностью ознакомиться с настоящими Правилами до момента регистрации на Сайте. Регистрация
                        Пользователя на Сайте означает полное и безоговорочное принятие Пользователем настоящих Правил в соответствии со
                        статьей 396 Гражданского кодекса Республики Казахстан.
                    </p>
                    <p className="text-justify indent-8">
                        Поскольку Правила в любое время могут быть изменены или дополнены владельцем Сайта,
                    </p>
                    <p className="text-justify indent-8">
                        Пользователю рекомендуется регулярно следить за обновлениями Правил. Продолжение использования Сайта Пользователем
                        после внесения изменений и/или дополнений в настоящие Правила означает принятие и согласие Пользователя с такими
                        изменениями и/или дополнениями.
                    </p>
                    <ol className="list-decimal ml-12">
                        <li>
                            Интеллектуальная собственность
                            <p className="text-justify indent-8">
                                Сайт работает при поддержке ТОО &laquo;Такеда Казахстан&raquo; (&laquo;Takeda&raquo;), которое &nbsp;также
                                является владельцем Сайта (адрес владельца Сайта: 050000, Алматы, ул. Шашкина, дом 44). Все содержимое
                                данного Сайта, включая статьи, иллюстрации, снимки экрана, видеоролики, графические элементы, логотипы и
                                другие файлы (&laquo;Контент&raquo;), защищено действующим законодательством Республики Казахстан и является
                                объектами интеллектуальной собственности Takeda либо иных правообладателей.
                            </p>
                            <p className="text-justify indent-8">
                                Размещая на Сайте Контент, принадлежащий Takeda на законных основаниях, Takeda предоставляет Пользователю
                                неисключительное право использования такого Контента путем просмотра, воспроизведения (в том числе
                                копирования), переработку (в том числе на распечатку копий) и иные права исключительно с целью личного
                                некоммерческого использования, кроме случаев, когда такое использование причиняет или может причинить вред
                                охраняемым законом интересам правообладателя.
                            </p>
                            <p className="text-justify indent-8">
                                Указанное право использования Контента Takeda предоставлено Пользователю исключительно при условии
                                сохранения всех знаков авторства или других уведомлений об авторстве, а также размещения на всех копиях
                                Контента следующей информации: &laquo;<a href="https://mymedkz.info/">https://mymedkz.info/</a>&raquo;
                                &copy; 2022. ТОО &laquo;Такеда Казахстан&raquo;, 050000, Алматы, ул. З.Шашкина, дом 44. Все права
                                защищены&raquo;.
                            </p>
                            <p className="text-justify indent-8">
                                Любое использование Сайта или Контента, кроме разрешенного в настоящих Правилах или в случае явно
                                выраженного согласия правообладателя на такое использование, без предварительного письменного разрешения
                                правообладателя, категорически запрещено.
                            </p>
                            <p className="text-justify indent-8">
                                Если иное явным образом не установлено в настоящих Правилах, ничто в настоящих Правилах не может быть
                                рассмотрено как передача исключительных прав на Контент.
                            </p>
                        </li>
                        <li>
                            Информация медицинского характера и иная информация, размещенная на Сайте
                            <p className="text-justify indent-8">
                                Настоящий Сайт представляет информационно-образовательный проект, созданный для информирования специалистов
                                здравоохранения и пациентов по терапевтическим направлениям Takeda. Указанная информация предоставлена
                                исключительно в справочных целях и ни в коем случае не является заменой консультации врача.
                            </p>
                            <p className="text-justify indent-8">
                                Информация, размещенная на Сайте, ни в коем случае не является заменой консультации врача, а также рекламой
                                лекарственных средств.
                            </p>
                            <p className="text-justify indent-8">
                                По любым вопросам, возникшим у Пользователя в связи с информацией медицинского характера, полученной на
                                данном Сайте, или по иным вопросам, касающимся заболеваний, необходимо всегда обращаться за консультацией к
                                врачу.
                            </p>
                            <p className="text-justify indent-8">
                                Информация, размещенная на Сайте, не является руководством по уходу за больным и лечению тех или иных
                                заболеваний. Никогда не следует пренебрегать профессиональной медицинской помощью или откладывать поход к
                                врачу особенно из-за информации, которую Пользователь прочитал на Сайте.
                            </p>
                            <p className="text-justify indent-8">
                                Содержащаяся на Сайте информация не является исчерпывающей, и не содержит данные обо всех заболеваниях,
                                недомоганиях, физических состояниях, симптомах или их лечении. Все данные, опросники или тесты,
                                представленные на Сайте, размещены только для справки и ни в коем случае не заменяют консультацию врача. Не
                                используйте информацию с Сайта для диагностики или лечения какого-либо недомогания или заболевания.
                            </p>
                            <p className="text-justify indent-8">
                                Не используйте Сайт для получения информации о неотложных заболеваниях или их лечении.
                            </p>
                            <p className="text-justify indent-8">
                                Данный Сайт не подходит для диагностики или лечения любых неотложных заболеваний. Если Вы нуждаетесь в
                                неотложной помощи, немедленно обратитесь к врачу или вызовете скорую помощь. Ни при каких обстоятельствах не
                                занимайтесь самолечением, в том числе используя информацию, увиденную или прочтенную на Сайте.
                            </p>
                        </li>
                        <li>
                            Ссылки на другие сайты в сети Интернет
                            <p className="text-justify indent-8">
                                Обязательства и ответственность Takeda не распространяются на сайты третьих лиц, на которые можно перейти,
                                используя ссылки, размещенных на Сайте. Takeda не имеет возможности контролировать содержание сайтов таких
                                третьих лиц, которые остаются полностью независимы от Takeda.
                            </p>
                            <p className="text-justify indent-8">
                                Ни при каких обстоятельствах Takeda не несет ответственность за содержание сайтов третьих лиц, не занимается
                                тщательным изучением, проверкой или одобрением содержания таких сайтов и не несет ответственность за их
                                наполнение, рекламу, продукты и другие компоненты, доступные на этих сайтах или через них.
                            </p>
                            <p className="text-justify indent-8">
                                Во избежание недоразумений Пользователю следует соблюдать меры предосторожности при скачивании информации
                                или иных файлов с Сайта или по размещенным на нем ссылкам, а также использовании любых файлов, в том числе
                                программного обеспечения.
                            </p>
                        </li>
                        <li>
                            Персональные данные и положения о конфиденциальности
                            <p className="text-justify indent-8">
                                При регистрации на Сайте либо при авторизации на Сайте посредством ввода логина и пароля моей страницы
                                Пользователя в социальной сети, Пользователь предоставляет ТОО &laquo;Такеда Казахстан&raquo; БИН
                                101140005730 &nbsp;(&laquo;Takeda&raquo;) свободно, в своей воле и в своём интересе информированное согласие
                                на обработку его персональных данных (&laquo;Согласие&raquo;) в порядке и на условиях, предусмотренных в
                                разделе 4 настоящих
                            </p>
                            <p className="text-justify indent-8">
                                Правил, с целью предоставления Пользователю доступа к использованию функционала Сайта, в том числе в целях
                                проверки, исследования и анализа таких данных, позволяющих поддерживать и улучшать функционал и разделы
                                Сайта, а также разрабатывать новый функционал и разделы Сайта.
                            </p>
                            <p className="text-justify indent-8">
                                Под персональными данными понимаются все личные данные Пользователя, предоставленные им при заполнении
                                регистрационной формы на Сайте.
                            </p>
                            <p className="text-justify indent-8">
                                Под обработкой персональных данных понимается любое действие (операция) или совокупность действий
                                (операций), совершаемых с использованием средств автоматизации или без использования таких средств с
                                персональными данными,
                            </p>
                            <p className="text-justify indent-8">
                                включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
                                использование, передачу (предоставление, доступ), в том числе трансграничную передачу, обезличивание,
                                блокирование, удаление и уничтожение персональных данных.
                            </p>
                            <p className="text-justify indent-8">
                                Обработка персональных данных Пользователя осуществляется в соответствии с законодательством Республики
                                Казахстан. Takeda предоставляет доступ к
                            </p>
                            <p className="text-justify indent-8">
                                персональным данным Пользователя только тем работникам, подрядчикам и агентам Takeda, которым эта информация
                                необходима для обеспечения функционирования Сайта и предоставления Пользователю доступа к его использованию.
                                Takeda вправе использовать предоставленную Пользователем информацию, в том числе
                            </p>
                            <p className="text-justify indent-8">
                                персональные данные, в целях обеспечения соблюдения требований законодательства Республики Казахстан (в том
                                числе в целях предупреждения и/или пресечения незаконных и/или противоправных действий Пользователей).
                            </p>
                            <p className="text-justify indent-8">
                                Регистрируясь на Сайте, Пользователь подтверждает свое согласие на передачу его персональных данных Takeda,
                                в том числе трансгранично, для их обработки в вышеуказанных целях, а также уполномоченному подрядчику
                                Takeda, осуществляющему техническую поддержку и иные услуги в отношении Сайта в целях исполнения договора,
                                заключенного между таким подрядчиком и Takeda. Takeda
                            </p>
                            <p className="text-justify indent-8">
                                обязуется обеспечить конфиденциальность и безопасность персональных данных Пользователя.
                            </p>
                            <p className="text-justify indent-8">
                                Согласие также распространяется на трансграничную передачу персональных данных и включает в себя передачу
                                персональных данных третьим лицам, за исключением распространения персональных данных в общедоступных
                                источниках.
                            </p>
                            <p className="text-justify indent-8">
                                Настоящее согласие действует в течение периода, необходимого для выполнения целей, указанных выше или до
                                момента его отзыва, или до момента удаления учетной записи Пользователя на Сайте. Пользователь
                            </p>
                            <p className="text-justify indent-8">
                                вправе в любой момент отозвать настоящее Согласие в порядке, установленном законодательством Республики
                                Казахстан.
                            </p>
                            <p className="text-justify indent-8">
                                Согласие можно отозвать, обратившись с запросом через почтовый ящик
                                <a href="mailto:Kazakhstan@takeda.com">Kazakhstan@takeda.com</a> или отправив письмо по адресу 050000,
                                Алматы, ул. Шашкина, дом 44.
                            </p>
                            <p className="text-justify indent-8">
                                Настоящее согласие распространяется на получение новостных сообщений по различным каналам связи, включая, но
                                не ограничиваясь, электронной почты/e-mail, SMS- сообщений, push-уведомления.
                            </p>
                        </li>
                        <li>
                            Запрещенное использование
                            <p className="text-justify indent-8">&nbsp;Пользователю запрещается:</p>
                            <ul className="list-disc ml-12">
                                <li>
                                    удалять из любой копии Контента знаки авторства или иные уведомления об авторстве, содержащиеся в
                                    соответствующем Контенте;
                                </li>
                                <li>
                                    при отсутствии предварительного письменного согласия Takeda отчуждать, воспроизводить, изменять или
                                    пытаться изменить содержание Контента, а также воспроизводить, публично демонстрировать, распространять
                                    или иным образом использовать Контент для общедоступного, коммерческого, не образовательного или не
                                    личного использования, включая использование Контента любым другим лицом, если это не предусмотрено
                                    самим Сайтом;
                                </li>
                                <li>
                                    печатать или копировать код HTML или другое программное обеспечение, которое можно получить на Сайте;
                                </li>
                                <li>
                                    при отсутствии предварительного письменного разрешения Takeda создавать зеркальную копию Сайта на другом
                                    сервере;
                                </li>
                                <li>
                                    использовать Сайт таким образом, которой может привести к повреждению Сайта, его отключению, перегрузке,
                                    ухудшению работы Сайта, нарушению безопасности или отрицательному воздействию на функционирование Сайта,
                                    или иным способом повредит Сайт или любые службы, системные ресурсы, аккаунты, серверы, сети, входящие в
                                    состав Сайта или связанные с ним, в которые можно войти через данный Сайт. Данный запрет включает в
                                    себя, в том числе загрузку, размещение или передачу на Сайт компьютерного вируса, вредоносной системы
                                    типа &laquo;Троянский конь&raquo;, &laquo;черви&raquo; или других файлов или компьютерных программ,
                                    которые потенциально опасны, разрушительны, или могут вызывать чрезмерные или непропорционально большие
                                    нагрузки на структуру Сайта;
                                </li>
                                <li>
                                    использовать боты, программы-обходчики или другие автоматические программы, приборы, или ручные
                                    манипуляции, для того, чтобы отслеживать, копировать, суммировать или иным способом извлекать информацию
                                    с Сайта, как полностью, так и частично;
                                </li>
                                <li>
                                    использовать или пытаться использовать информацию третьих лиц, связанную с данным Сайтом, создавать или
                                    использовать ложное удостоверение личности для работы на данном Сайте;
                                </li>
                                <li>
                                    выдавать себя за другое лицо или предприятие, или иным образом искажать связь Пользователя с любым
                                    физическим или юридическим лицом, или попытаться получить несанкционированный доступ Сайту или его
                                    частям, которые закрыты для общего доступа;
                                </li>
                                <li>
                                    использовать адрес электронной почты, который не принадлежит Пользователю, или владелец которого не
                                    разрешал его регистрировать;
                                </li>
                                <li>
                                    предоставлять не полную, ложную или неточную информацию, включая неполные, ложные или неточные анкетные
                                    данные;
                                </li>
                                <li>
                                    размещать или передавать любой незаконный, опасный, оскорбительный, дискредитирующий, клеветнический,
                                    вульгарный, неприличный или неправомерный контент, который нарушает или посягает на авторские права,
                                    торговые марки, коммерческие секреты, частную жизнь или другие права и интересы третьего лица, или
                                    размещение которого является уголовно наказуемым или влечет гражданскую или административную
                                    ответственность или другим образом нарушает действующее законодательство Республики Казахстан.
                                </li>
                            </ul>
                            <p className="text-justify indent-8">
                                Пользователь настоящим принимает на себя полную ответственность за совершенные им действия или бездействие и
                                предоставленную им информацию во время пользования Сайтом, а также обязуется следовать всем законам, нормам
                                и правилам, регулирующим использование Сайта, работу или действия, выполненные на нем, и касающиеся
                                Контента.
                            </p>
                        </li>
                        <li>
                            Доступность Сайта
                            <p className="text-justify indent-8">
                                Настоящим Takeda уведомляет Пользователя о том, что: (i) технически невозможно обеспечить функционирование
                                Сайта без каких-либо дефектов, и Takeda не может взять это обязательство на себя; (ii) дефекты Сайта могут
                                привести к временной недоступности Сайта; а также, что (iii) на работу Сайта могут оказать негативное
                                воздействие события и/или действия, которые Takeda не может контролировать, как, например, способы передачи
                                данных и связи.
                            </p>
                            <p className="text-justify indent-8">
                                Takeda и/или ее подрядчики могут в любое время изменить или прервать, временно или постоянно, работу всего
                                Сайта или какой-либо его части для осуществления технического обслуживания и/или улучшения и/или изменения
                                Сайта. Takeda не несет никакой ответственности за какие бы то ни было изменения, временную приостановку или
                                сбой в работе Сайта.
                            </p>
                        </li>
                        <li>
                            Заключительные положения
                            <p className="text-justify indent-8">
                                Сайт и его Контент регулируются законодательством Республики Казахстан, и любые споры, связанные с этим,
                                попадают юрисдикцию судов Республики Казахстан.
                            </p>
                            <p className="text-justify indent-8">
                                Настоящие Правила составляют соглашение между Пользователем и Takeda относительно порядка использования
                                Сайта, его Контента и функционала и заменяют собой все предыдущие соглашения между Пользователем и Takeda.
                            </p>
                            <p className="text-justify indent-8">
                                Настоящие Правила подлежат регулированию и толкованию в соответствии с действующим законодательством
                                Республики Казахстан. Вопросы, не урегулированные Правилами, подлежат разрешению в соответствии с
                                действующим законодательством Республики Казахстан.
                            </p>
                            <p className="text-justify indent-8">
                                При возникновении каких-либо споров или разногласий, связанных с исполнением настоящих Правил, Пользователь
                                и Takeda обязуются приложить все разумные усилия для их урегулирования путем проведения переговоров между
                                ними. Если какой-либо спор или разногласие не будет разрешен путем переговоров, данный спор или разногласие
                                подлежит разрешению в порядке, установленном действующим законодательством Республики Казахстан в
                                Арбитражном суде по месту нахождения ответчика.
                            </p>
                            <p className="text-justify indent-8">
                                Настоящие Правила вступают в силу для Пользователя с момента его присоединения к ним и действуют в течение
                                неопределенного срока.
                            </p>
                            <p className="text-justify indent-8">
                                Если по тем или иным причинам одно или несколько положений настоящих Правил будут признаны недействительными
                                или не имеющими юридической силы, это не оказывает влияния на действительность или применимость остальных
                                положений Правил.
                            </p>
                        </li>
                        <li>
                            Условия выпуска Сайта
                            <p className="text-justify indent-8">
                                Владельцем Сайта является ТОО &laquo;Такеда Казахстан&raquo;, адрес: 050000, Алматы, ул. З.Шашкина, дом 44.
                            </p>
                        </li>
                    </ol>
                </div>
            )
        },
        {
            name: 'Пайдаланушы келісімі және жеке деректер',
            content: (
                <div className="flex flex-col gap-3 mb-9">
                    <p className="text-justify indent-8">
                        Төменде келтірілген
                        <a href="https://mymedkz.info/">https://mymedkz.info/</a>&nbsp;сайтын пайдалану қағидаларымен
                        (&laquo;Қағидалар&raquo;) мұқият танысып шығуыңызды өтінеміз.
                    </p>
                    <p className="text-justify indent-8">
                        Бұл парақшада сайтты пайдаланушының (&laquo;Пайдаланушы&raquo;)
                        <a href="https://mymedkz.info/">https://mymedkz.info/</a>&nbsp;ақпараттық порталын (&laquo;Сайт&raquo;) пайдалануын
                        реттейтін шарттар сипатталған.
                    </p>
                    <p className="text-justify indent-8">
                        Пайдаланушы сайтта тіркелгенге дейін осы қағидалармен толық танысуға міндетті. Пайдаланушыны сайтта тіркеу Қазақстан
                        Республикасы Азаматтық кодексінің 396-бабына сәйкес пайдаланушының осы қағидаларды толық және сөзсіз қабылдауын
                        білдіреді.
                    </p>
                    <p className="text-justify indent-8">
                        Қағидалар кез-келген уақытта сайт иесімен өзгертілуі немесе толықтырылуы мүмкін болғандықтан, пайдаланушыға
                        қағидалардың жаңартылуын үнемі қадағалап отыру ұсынылады. Осы қағидаларға өзгерістер және/немесе толықтырулар
                        енгізілгеннен кейін пайдаланушының сайтты пайдалануын жалғастыру пайдаланушының осындай өзгерістерді және/немесе
                        толықтыруларды қабылдауын және олармен келісуін білдіреді.
                    </p>
                    <ol className="list-decimal ml-12">
                        <li>
                            Зияткерлік меншік
                            <p className="text-justify indent-8">
                                Сайт &laquo;Такеда Қазақстан&raquo; ЖШС (&laquo;Takeda&raquo;) қолдауымен жұмыс істейді, сондай-ақ ол
                                сайттың иесі болып табылады (сайттың иесінің мекен-жайы: 050000, Алматы, Шашкин көшесі, 44-үй). Мақалаларды,
                                иллюстрацияларды, экран суреттерін, бейнероликтерді, графикалық элементтерді, логотиптерді және басқа
                                файлдарды (&laquo;Контент&raquo;) қоса алғанда, осы сайттың барлық мазмұны Қазақстан Республикасының
                                қолданыстағы заңнамасымен қорғалған және Takeda немесе басқа құқық иеленушілердің зияткерлік меншік
                                объектілері болып табылады.
                            </p>
                            <p className="text-justify indent-8">
                                Takeda-ға тиесілі контентті сайтқа заңды түрде орналастыру арқылы. мұндай пайдалану құқық иеленушінің заңмен
                                қорғалатын мүдделеріне зиян келтіретін немесе зиян келтіруі мүмкін жағдайларды қоспағанда, Takeda
                                пайдаланушыға мұндай контентті тек жеке коммерциялық емес пайдалану мақсатында қарау, шығару (оның ішінде
                                көшіру), қайта өңдеу (оның ішінде көшірмелерді басып шығару) және басқа да құқықтарды пайдалану арқылы
                                ерекше емес құқықты ұсынады.
                            </p>
                            <p className="text-justify indent-8">
                                Takeda контентін пайдаланудың көрсетілген құқығы пайдаланушыға тек авторлық белгілердің барлығы немесе
                                авторлық туралы басқа да ескертулер сақталған, сондай-ақ контенттің барлық көшірмелерінде мынадай ақпарат
                                орналастырылған жағдайда ғана беріледі: &laquo;<a href="https://mymedkz.info/">https://mymedkz.info/</a>
                                &raquo; &copy; 2022. &laquo;Такеда Қазақстан&raquo; ЖШС, 050000, Алматы, З. Шашкин к-сі, 44-үй. Барлық
                                құқықтар қорғалған&raquo;.
                            </p>
                            <p className="text-justify indent-8">
                                Осы қағидаларда рұқсат етілгеннен немесе құқық иеленушінің мұндай пайдалануға айқын келісімі болған
                                жағдайдан басқа, құқық иеленушінің алдын ала жазбаша рұқсатынсыз сайтты немесе контентті кез келген мақсатта
                                пайдалануға қатаң тыйым салынады.
                            </p>
                            <p className="text-justify indent-8">
                                Егер осы қағидаларда өзгеше анық түрде белгіленбесе, осы қағидалардағы ештеңе контентке айрықша құқықтарды
                                беру ретінде қарастырылмайды.
                            </p>
                        </li>
                        <li>
                            Медициналық сипаттағы ақпарат және сайтта орналастырылған өзге де ақпарат
                            <p className="text-justify indent-8">
                                Осы сайт Takeda терапевтік бағыттары бойынша денсаулық сақтау мамандары мен пациенттерді ақпараттандыру үшін
                                жасалған ақпараттық-білім беру жобасы болып табылады. Көрсетілген ақпарат тек анықтама мақсатында ғана
                                берілген және ешбір жағдайда дәрігердің кеңесін алмастырмайды.
                            </p>
                            <p className="text-justify indent-8">
                                Сайтта орналастырылған ақпарат ешқандай жағдайда дәрігердің кеңесін алмастырмайды, сондай-ақ
                                дәрі-дәрмектердің жарнамасы емес.
                            </p>
                            <p className="text-justify indent-8">
                                Пайдаланушының осы сайтта алынған медициналық сипаттағы ақпаратқа байланысты туындаған кез келген сұрақтары
                                бойынша немесе ауруларға қатысты өзге де сұрақтар бойынша әрдайым дәрігердің кеңесіне жүгіну қажет.
                            </p>
                            <p className="text-justify indent-8">
                                Сайтта орналастырылған ақпарат науқасқа күтім жасау және белгілі бір ауруларды емдеу жөніндегі нұсқаулық
                                болып табылмайды. Кәсіби медициналық көмекке ешқашан салғырт қарауға болмайды немесе пайдаланушы сайтта
                                оқыған ақпаратқа байланысты дәрігерге баруды кейінге қалдыруға болмайды.
                            </p>
                            <p className="text-justify indent-8">
                                Сайттағы ақпарат түпкілікті емес және барлық аурулар, сырқаттар, физикалық жай-күйлер, симптомдар немесе
                                оларды емдеу туралы деректерді қамтымайды. Сайтта ұсынылған барлық деректер, сауалнамалар немесе тесттер тек
                                анықтама үшін орналастырылған және ешқандай жағдайда дәрігердің кеңесін алмастырмайды. Кез-келген сырқатты
                                немесе ауруды диагностикалау немесе емдеу үшін сайттағы ақпаратты пайдаланбаңыз.
                            </p>
                            <p className="text-justify indent-8">
                                Шұғыл аурулар немесе оларды емдеу туралы ақпарат алу үшін сайтты пайдаланбаңыз.
                            </p>
                            <p className="text-justify indent-8">
                                Бұл сайт кез-келген шұғыл ауруларды диагностикалауға немесе емдеуге жарамайды. Егер сізге шұғыл көмек қажет
                                болса, дереу дәрігерге қаралыңыз немесе жедел жәрдем шақырыңыз. Ешбір жағдайда, оның ішінде сайтта көрген
                                немесе оқыған ақпаратты пайдалана отырып, өзін-өзі емдеумен айналыспаңыз.
                            </p>
                        </li>
                        <li>
                            Интернет желісіндегі басқа сайттарға сілтемелер
                            <p className="text-justify indent-8">
                                Takeda міндеттемелері мен жауапкершілігі сайтта орналастырылған сілтемелерді пайдалана отырып, өтуге болатын
                                үшінші тұлғалардың сайттарына қолданылмайды. Takeda-ның Takeda-дан толықтай тәуелсіз болып қалатын үшінші
                                тұлғалардың сайттарының мазмұнын бақылау мүмкіндігі жоқ.
                            </p>
                            <p className="text-justify indent-8">
                                Ешбір жағдайда Takeda үшінші тұлғалардың сайттарының мазмұны үшін жауап бермейді, осындай сайттардың
                                мазмұнын мұқият зерттеумен, тексерумен немесе мақұлдаумен айналыспайды және олардың мазмұны, жарнамасы,
                                өнімдері және осы сайттарда немесе олар арқылы қолжетімді басқа компоненттер үшін жауап бермейді.
                            </p>
                            <p className="text-justify indent-8">
                                Түсінбеушілікті болдырмау үшін пайдаланушы сайттан немесе онда орналастырылған сілтемелер бойынша ақпаратты
                                немесе өзге файлдарды жүктеу, сондай-ақ кез келген файлдарды, оның ішінде бағдарламалық жасақтаманы
                                пайдалану кезінде сақтық шараларын сақтауы тиіс.
                            </p>
                        </li>
                        <li>
                            Дербес деректер және құпиялылық туралы ережелер
                            <p className="text-justify indent-8">
                                Сайтта тіркелген кезде немесе сайтта әлеуметтік желідегі менің пайдаланушы парақшамның логині мен құпия
                                сөзін енгізу арқылы авторизациядан өткен кезде, пайдаланушы БСН 101140005730, &laquo;Такеда Қазақстан&raquo;
                                ЖШС-не (&laquo;Takeda&raquo;) осы қағидалардың 4-бөлімінде көзделген тәртіппен және шарттар бойынша
                                пайдаланушыға сайт функционалын пайдалануға рұқсат беру мақсатында, оның ішінде сайттың функционалы мен
                                бөлімдерін қолдауға және жақсартуға, сондай-ақ сайттың жаңа функционалы мен бөлімдерін әзірлеуге мүмкіндік
                                беретін осындай деректерді тексеру, зерттеу және талдау мақсатында еркін, өз еркімен және өз мүддесінде оның
                                дербес деректерін өңдеуге хабардар етілген келісімін (&laquo;Келісім&raquo;) береді.
                            </p>
                            <p className="text-justify indent-8">
                                Дербес деректер деп сайтта тіркеу нысанын толтыру кезінде пайдаланушының берген барлық дербес деректері
                                түсініледі.
                            </p>
                            <p className="text-justify indent-8">
                                Дербес деректерді өңдеу деп жинауды, жазуды, жүйелеуді, жинақтауды, сақтауды, нақтылауды (жаңартуды,
                                өзгертуді), алуды, пайдалануды, беруді (ұсынуды, қолжетімділікті), соның ішінде дербес деректерді
                                трансшекаралық беруді, иесіздендіруді, бұғаттауды, кетіруді және жоюды қоса алғанда, дербес деректермен
                                автоматтандыру құралдарын пайдалана отырып немесе осындай құралдарды пайдаланбай жасалатын кез келген
                                іс-әрекет (операция) немесе іс-әрекеттердің (операциялар) жиынтығы түсініледі.
                            </p>
                            <p className="text-justify indent-8">
                                Пайдаланушының дербес деректерін өңдеу Қазақстан Республикасының заңнамасына сәйкес жүзеге асырылады. Takeda
                                пайдаланушының дербес деректеріне тек осы ақпарат сайттың жұмыс істеуін қамтамасыз ету және пайдаланушыға
                                оны пайдалануға рұқсат беру үшін қажет Takeda қызметкерлеріне, мердігерлеріне және агенттеріне қолжеткізуді
                                қамтамасыз етеді. Takeda пайдаланушы ұсынған ақпаратты, оның ішінде дербес деректерді Қазақстан Республикасы
                                заңнамасының талаптарын сақтауды қамтамасыз ету мақсатында (оның ішінде пайдаланушылардың заңсыз және/немесе
                                құқыққа қарсы әрекеттерінің алдын алу және/немесе жолын кесу мақсатында) пайдалануға құқылы.
                            </p>
                            <p className="text-justify indent-8">
                                Сайтта тіркеле отырып, пайдаланушы өзінің дербес деректерін жоғарыда көрсетілген мақсаттарда өңдеу үшін
                                Takeda-ға, оның ішінде трансшекаралық түрде беруге, сондай-ақ осындай мердігер мен Takeda арасында жасалған
                                шартты орындау мақсатында сайтқа қатысты техникалық қолдауды және өзге де қызметтерді жүзеге асыратын Takeda
                                уәкілетті мердігеріне өзінің келісімін растайды. Takeda пайдаланушының дербес деректерінің құпиялылығы мен
                                қауіпсіздігін қамтамасыз етуге міндеттенеді.
                            </p>
                            <p className="text-justify indent-8">
                                Келісім дербес деректерді трансшекаралық беруге де қолданылады және дербес деректерді жалпыға қолжетімді
                                көздерде таратуды қоспағанда, дербес деректерді үшінші тұлғаларға беруді қамтиды.
                            </p>
                            <p className="text-justify indent-8">
                                Осы келісім жоғарыда көрсетілген мақсаттарды орындау үшін қажетті кезең ішінде немесе оны кері қайтарып алу
                                сәтіне дейін немесе пайдаланушының сайттағы есеп жазбасын жойған сәтке дейін қолданылады. Пайдаланушы кез
                                келген сәтте Қазақстан Республикасының заңнамасында белгіленген тәртіппен осы келісімді кері қайтарып алуға
                                құқылы.
                            </p>
                            <p className="text-justify indent-8">
                                Келісімді кері шақыру үшін
                                <a href="mailto:Kazakhstan@takeda.com">Kazakhstan@takeda.com</a> электрондық поштаға немесе 050000, Алматы,
                                Шашкина көшесі, 44 үй адресіне хат жаза аласыз.
                            </p>
                            <p className="text-justify indent-8">
                                Осы келісім электрондық поштаны/e-mail, SMS-хабарламаларды, push-ескертулерді қоса алғанда, бірақ олармен
                                шектелмей, әртүрлі байланыс арналары арқылы жаңалықтар хабарламаларын алуға қолданылады.
                            </p>
                        </li>
                        <li>
                            Тыйым салынған пайдалану
                            <p className="text-justify indent-8">&nbsp;Пайдаланушыға тыйым салынады:</p>
                            <ul className="list-disc ml-12">
                                <li>
                                    тиісті контенттегі авторлық белгілерді немесе басқа авторлық туралы ескертулерді контенттің кез келген
                                    көшірмесінен жою;
                                </li>
                                <li>
                                    Takeda-ның алдын-ала жазбаша келісім болмаған жағдайда, контенттің мазмұнын иеліктен шығару, жаңғырту,
                                    өзгерту немесе өзгертуге тырысу, сондай-ақ, егер сайттың өзінде қарастырылмаса, контентті кез-келген
                                    басқа адамның пайдалануын қоса алғанда, жалпыға қол жетімді, коммерциялық, білім беру немесе жеке
                                    пайдалану үшін контентті жаңғырту, көпшілікке көрсету, тарату немесе басқаша пайдалану;
                                </li>
                                <li>сайттан алуға болатын HTML кодын немесе басқа бағдарламалық жасақтаманы басып шығару немесе көшіру;</li>
                                <li>Takeda-ның алдын-ала жазбаша рұқсаты болмаса, басқа серверде сайттың айна көшірмесін жасау;</li>
                                <li>
                                    сайттың зақымдалуына, оның өшірілуіне, шамадан тыс жүктелуіне, сайттың жұмысының нашарлауына,
                                    қауіпсіздіктің бұзылуына немесе сайттың жұмыс істеуіне теріс әсер етуге әкеп соғуы мүмкін немесе өзге
                                    тәсілмен сайтқа немесе сайттың құрамына кіретін немесе осы сайт арқылы кіруге болатын, онымен байланысты
                                    кез келген қызметтерге, жүйелік ресурстарға, аккаунттарға, серверлерге, желілерге зиян келтіретін жолмен
                                    сайтты пайдалану. Бұл тыйым компьютерлік вирусты, &laquo;трояндық ат&raquo;, &laquo;құрттар&raquo;
                                    сияқты зиянды жүйені немесе ықтимал қауіпті, жойқын немесе сайт құрылымына шамадан тыс немесе
                                    пропорционалды емес үлкен жүктемелер тудыруы мүмкін басқа файлдарды немесе компьютерлік бағдарламаларды
                                    жүктеуді, орналастыруды немесе сайтқа жіберуді қамтиды;
                                </li>
                                <li>
                                    сайттан ақпаратты толық немесе ішінара бақылау, көшіру, жинақтау немесе басқа жолмен алу үшін боттарды,
                                    аралау бағдарламаларын немесе басқа автоматты бағдарламаларды, құрылғыларды немесе қолмен
                                    манипуляцияларды қолдану;
                                </li>
                                <li>
                                    осы сайтқа қатысты үшінші тұлғалардың ақпаратын пайдалану немесе қолдануға тырысу, осы сайтта жұмыс
                                    істеу үшін жалған жеке куәлікті жасау немесе пайдалану;
                                </li>
                                <li>
                                    басқа тұлға немесе кәсіпорын ретінде әрекет ету немесе пайдаланушының кез-келген жеке немесе заңды
                                    тұлғамен байланысын басқаша бұрмалау немесе сайтқа немесе оның жалпыға бірдей пайдалануға жабық
                                    бөліктеріне рұқсатсыз қол жеткізуге тырысу;
                                </li>
                                <li>
                                    пайдаланушыға тиесілі емес немесе иесі оны тіркеуге рұқсат бермеген электрондық пошта мекен-жайын
                                    пайдалану;
                                </li>
                                <li>
                                    толық емес, жалған немесе нақты емес ақпаратты, оның ішінде толық емес, жалған немесе нақты емес
                                    сауалнамалық деректерді ұсыну;
                                </li>
                                <li>
                                    авторлық құқықты, сауда маркаларын, коммерциялық құпияларды, жеке өмірді немесе үшінші тұлғаның басқа да
                                    құқықтары мен мүдделерін бұзатын немесе оған қол сұғатын немесе оны орналастыру қылмыстық жазаланатын
                                    немесе азаматтық немесе әкімшілік жауаптылыққа әкеп соғатын немесе Қазақстан Республикасының
                                    қолданыстағы заңнамасын басқаша түрде бұзатын кез келген заңсыз, қауіпті, қорлайтын, беделін түсіретін,
                                    жала жабатын, әдепсіз немесе заңсыз контентті орналастыру немесе беру.
                                </li>
                            </ul>
                            <p className="text-justify indent-8">
                                Пайдаланушы осы құжатпен сайтты пайдалану кезінде өзі жасаған әрекеттер немесе әрекетсіздік және оларға
                                берілген ақпарат үшін толық жауапкершілікті өзіне алады, сондай-ақ сайтты пайдалануды реттейтін, онда
                                орындалған жұмыстар мен іс-әрекеттерді және контентке қатысты барлық заңдарды, нормалар мен қағидаларды
                                ұстануға міндеттенеді.
                            </p>
                        </li>
                        <li>
                            Сайттың қолжетімділігі
                            <p className="text-justify indent-8">
                                Осы құжат арқылы Takeda пайдаланушыға төмендегілер туралы хабарлайды: (i) сайттың жұмыс істеуін қандай да
                                бір ақауларсыз қамтамасыз ету техникалық мүмкін емес және Takeda бұл міндеттемені өзіне ала алмайды; (ii)
                                сайттың ақаулары сайттың уақытша қолжетімсіз болуына әкелуі мүмкін; сондай-ақ (iii) Takeda басқара алмайтын
                                оқиға және/немесе әрекеттер, мысалы, деректерді беру және байланыс тәсілдері сайттың жұмысына жағымсыз әсер
                                етуі мүмкін.
                            </p>
                            <p className="text-justify indent-8">
                                Takeda және/немесе оның мердігерлері техникалық қызмет көрсетуді жүзеге асыру және/немесе сайтты жақсарту
                                және/немесе өзгерту үшін бүкіл сайттың немесе оның қандай да бір бөлігінің жұмысын уақытша немесе тұрақты
                                түрде кез келген уақытта өзгерте немесе тоқтата алады. Takeda сайттың қандай да бір өзгеруіне, уақытша
                                тоқтатылуына немесе бұзылуына жауап бермейді.
                            </p>
                        </li>
                        <li>
                            Қорытынды ережелер
                            <p className="text-justify indent-8">
                                Сайт пен оның контенті Қазақстан Республикасының заңнамасымен реттеледі және осыған байланысты кез келген
                                даулар Қазақстан Республикасы соттарының юрисдикциясына тиесілі.
                            </p>
                            <p className="text-justify indent-8">
                                Осы қағидалар сайтты пайдалану тәртібіне, оның контентіне және функционалына қатысты пайдаланушы мен Takeda
                                арасындағы келісімді құрайды және пайдаланушы мен Takeda арасындағы барлық алдыңғы келісімдерді алмастырады.
                            </p>
                            <p className="text-justify indent-8">
                                Осы қағидалар Қазақстан Республикасының қолданыстағы заңнамасына сәйкес реттелуі және түсіндірілуі тиіс.
                                Қағидалармен реттелмеген мәселелер Қазақстан Республикасының қолданыстағы заңнамасына сәйкес шешілуге тиіс.
                            </p>
                            <p className="text-justify indent-8">
                                Осы қағидаларды орындаумен байланысты қандай да бір даулар немесе келіспеушіліктер туындаған кезде,
                                пайдаланушы мен Takeda олардың арасында келіссөздер жүргізу арқылы оларды реттеу үшін барлық ақылға қонымды
                                күш-жігерді жұмсауға міндеттенеді. Егер қандай да бір дау немесе келіспеушілік келіссөздер жолымен
                                шешілмесе, осы дау немесе келіспеушілік Қазақстан Республикасының қолданыстағы заңнамасында белгіленген
                                тәртіппен жауапкердің орналасқан жері бойынша төрелік сотта шешілуге тиіс.
                            </p>
                            <p className="text-justify indent-8">
                                Осы қағидалар пайдаланушы үшін оған қосылған сәттен бастап күшіне енеді және белгісіз мерзім ішінде
                                қолданылады.
                            </p>
                            <p className="text-justify indent-8">
                                Егер қандай да бір себептер бойынша осы қағидалардың бір немесе бірнеше ережелері жарамсыз немесе заңдық
                                күші жоқ деп танылса, бұл қағидалардың қалған ережелерінің жарамдылығына немесе қолданылуына әсер етпейді.
                            </p>
                        </li>
                        <li>
                            Сайтты шығару шарттары
                            <p className="text-justify indent-8">
                                Сайттың иесі - &laquo;Такеда Қазақстан&raquo; ЖШС, мекен-жайы: 050000, Алматы, З. Шашкин көшесі, 44-үй.
                            </p>
                        </li>
                    </ol>
                </div>
            )
        }
    ];

    return (
        <>
            <div className="w-full mx-auto ">
                <h1 className="text-[1.6rem] leading-8 mb-0 font-bold uppercase text-black text-center py-3 border-t-4 border-b-[1px] border-solid border-t-borgerColor border-b-dividerColor">
                    {t('userAgree')} <br />
                    {t('userAgree2')}
                </h1>

                <div className="flex space-x-1 rounded-xl bg-white-900/20 px-11 pb-6 pt-4">
                    {tabs.map((tab, index) => (
                        <button
                            key={index}
                            onClick={() => setActiveTab(index)}
                            className={classNames(
                                'w-full rounded-tl-[5px] rounded-tr-[5px] text-black py-2.5 text-sm font-medium leading-5',

                                activeTab === index
                                    ? 'bg-backgroundColorTabs text-white shadow'
                                    : 'text-white-100 hover:bg-backgroundColorTabs hover:text-white'
                            )}
                        >
                            {tab.name}
                        </button>
                    ))}
                </div>

                {/* Контент активної вкладки */}
                <div className="px-10">{tabs[activeTab].content}</div>
            </div>
            <Footer />
        </>
    );
}
